SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_lcd.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG28 LCD register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG28_LCD_H
#define EFR32SG28_LCD_H

#define LCD_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG28_LCD LCD
 * @{
 * @brief EFR32SG28 LCD Register Declaration.
 *****************************************************************************/

/** LCD Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IPVERSION                                          */
  __IOM uint32_t             EN;                     /**< Enable                                             */
  __IOM uint32_t             SWRST;                  /**< Software Reset                                     */
  __IOM uint32_t             CTRL;                   /**< Control Register                                   */
  __IOM uint32_t             CMD;                    /**< Command register                                   */
  __IOM uint32_t             DISPCTRL;               /**< Display Control Register                           */
  __IOM uint32_t             BACFG;                  /**< Blink and Animation Config Register                */
  __IOM uint32_t             BACTRL;                 /**< Blink and Animation Control Register               */
  __IM  uint32_t             STATUS;                 /**< Status Register                                    */
  __IOM uint32_t             AREGA;                  /**< Animation Register A                               */
  __IOM uint32_t             AREGB;                  /**< Animation Register B                               */
  __IOM uint32_t             IF;                     /**< Interrupt Enable Register                          */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable                                   */
  __IOM uint32_t             BIASCTRL;               /**< Analog BIAS Control                                */
  __IOM uint32_t             DISPCTRLX;              /**< Display Control Extended                           */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             SEGD0;                  /**< Segment Data Register 0                            */
        uint32_t             RESERVED1[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             SEGD1;                  /**< Segment Data Register 1                            */
        uint32_t             RESERVED2[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             SEGD2;                  /**< Segment Data Register 2                            */
        uint32_t             RESERVED3[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             SEGD3;                  /**< Segment Data Register 3                            */
        uint32_t             RESERVED4[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             SEGD4;                  /**< Segment Data Register 4                            */
        uint32_t             RESERVED5[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             SEGD5;                  /**< Segment Data Register 5                            */
        uint32_t             RESERVED6[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             SEGD6;                  /**< Segment Data Register 6                            */
        uint32_t             RESERVED7[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             SEGD7;                  /**< Segment Data Register 7                            */
        uint32_t             RESERVED8[17U];         /**< Reserved for future use                            */
  __IOM uint32_t             UPDATECTRL;             /**< Update Control                                     */
        uint32_t             RESERVED9[11U];         /**< Reserved for future use                            */
  __IOM uint32_t             FRAMERATE;              /**< Frame Rate                                         */
        uint32_t             RESERVED10[963U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_SET;                 /**< Enable                                             */
  __IOM uint32_t             SWRST_SET;              /**< Software Reset                                     */
  __IOM uint32_t             CTRL_SET;               /**< Control Register                                   */
  __IOM uint32_t             CMD_SET;                /**< Command register                                   */
  __IOM uint32_t             DISPCTRL_SET;           /**< Display Control Register                           */
  __IOM uint32_t             BACFG_SET;              /**< Blink and Animation Config Register                */
  __IOM uint32_t             BACTRL_SET;             /**< Blink and Animation Control Register               */
  __IM  uint32_t             STATUS_SET;             /**< Status Register                                    */
  __IOM uint32_t             AREGA_SET;              /**< Animation Register A                               */
  __IOM uint32_t             AREGB_SET;              /**< Animation Register B                               */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Enable Register                          */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable                                   */
  __IOM uint32_t             BIASCTRL_SET;           /**< Analog BIAS Control                                */
  __IOM uint32_t             DISPCTRLX_SET;          /**< Display Control Extended                           */
        uint32_t             RESERVED11[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD0_SET;              /**< Segment Data Register 0                            */
        uint32_t             RESERVED12[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD1_SET;              /**< Segment Data Register 1                            */
        uint32_t             RESERVED13[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD2_SET;              /**< Segment Data Register 2                            */
        uint32_t             RESERVED14[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD3_SET;              /**< Segment Data Register 3                            */
        uint32_t             RESERVED15[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD4_SET;              /**< Segment Data Register 4                            */
        uint32_t             RESERVED16[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD5_SET;              /**< Segment Data Register 5                            */
        uint32_t             RESERVED17[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD6_SET;              /**< Segment Data Register 6                            */
        uint32_t             RESERVED18[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD7_SET;              /**< Segment Data Register 7                            */
        uint32_t             RESERVED19[17U];        /**< Reserved for future use                            */
  __IOM uint32_t             UPDATECTRL_SET;         /**< Update Control                                     */
        uint32_t             RESERVED20[11U];        /**< Reserved for future use                            */
  __IOM uint32_t             FRAMERATE_SET;          /**< Frame Rate                                         */
        uint32_t             RESERVED21[963U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_CLR;                 /**< Enable                                             */
  __IOM uint32_t             SWRST_CLR;              /**< Software Reset                                     */
  __IOM uint32_t             CTRL_CLR;               /**< Control Register                                   */
  __IOM uint32_t             CMD_CLR;                /**< Command register                                   */
  __IOM uint32_t             DISPCTRL_CLR;           /**< Display Control Register                           */
  __IOM uint32_t             BACFG_CLR;              /**< Blink and Animation Config Register                */
  __IOM uint32_t             BACTRL_CLR;             /**< Blink and Animation Control Register               */
  __IM  uint32_t             STATUS_CLR;             /**< Status Register                                    */
  __IOM uint32_t             AREGA_CLR;              /**< Animation Register A                               */
  __IOM uint32_t             AREGB_CLR;              /**< Animation Register B                               */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Enable Register                          */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable                                   */
  __IOM uint32_t             BIASCTRL_CLR;           /**< Analog BIAS Control                                */
  __IOM uint32_t             DISPCTRLX_CLR;          /**< Display Control Extended                           */
        uint32_t             RESERVED22[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD0_CLR;              /**< Segment Data Register 0                            */
        uint32_t             RESERVED23[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD1_CLR;              /**< Segment Data Register 1                            */
        uint32_t             RESERVED24[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD2_CLR;              /**< Segment Data Register 2                            */
        uint32_t             RESERVED25[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD3_CLR;              /**< Segment Data Register 3                            */
        uint32_t             RESERVED26[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD4_CLR;              /**< Segment Data Register 4                            */
        uint32_t             RESERVED27[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD5_CLR;              /**< Segment Data Register 5                            */
        uint32_t             RESERVED28[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD6_CLR;              /**< Segment Data Register 6                            */
        uint32_t             RESERVED29[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD7_CLR;              /**< Segment Data Register 7                            */
        uint32_t             RESERVED30[17U];        /**< Reserved for future use                            */
  __IOM uint32_t             UPDATECTRL_CLR;         /**< Update Control                                     */
        uint32_t             RESERVED31[11U];        /**< Reserved for future use                            */
  __IOM uint32_t             FRAMERATE_CLR;          /**< Frame Rate                                         */
        uint32_t             RESERVED32[963U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_TGL;                 /**< Enable                                             */
  __IOM uint32_t             SWRST_TGL;              /**< Software Reset                                     */
  __IOM uint32_t             CTRL_TGL;               /**< Control Register                                   */
  __IOM uint32_t             CMD_TGL;                /**< Command register                                   */
  __IOM uint32_t             DISPCTRL_TGL;           /**< Display Control Register                           */
  __IOM uint32_t             BACFG_TGL;              /**< Blink and Animation Config Register                */
  __IOM uint32_t             BACTRL_TGL;             /**< Blink and Animation Control Register               */
  __IM  uint32_t             STATUS_TGL;             /**< Status Register                                    */
  __IOM uint32_t             AREGA_TGL;              /**< Animation Register A                               */
  __IOM uint32_t             AREGB_TGL;              /**< Animation Register B                               */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Enable Register                          */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable                                   */
  __IOM uint32_t             BIASCTRL_TGL;           /**< Analog BIAS Control                                */
  __IOM uint32_t             DISPCTRLX_TGL;          /**< Display Control Extended                           */
        uint32_t             RESERVED33[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD0_TGL;              /**< Segment Data Register 0                            */
        uint32_t             RESERVED34[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD1_TGL;              /**< Segment Data Register 1                            */
        uint32_t             RESERVED35[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD2_TGL;              /**< Segment Data Register 2                            */
        uint32_t             RESERVED36[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD3_TGL;              /**< Segment Data Register 3                            */
        uint32_t             RESERVED37[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD4_TGL;              /**< Segment Data Register 4                            */
        uint32_t             RESERVED38[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD5_TGL;              /**< Segment Data Register 5                            */
        uint32_t             RESERVED39[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD6_TGL;              /**< Segment Data Register 6                            */
        uint32_t             RESERVED40[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SEGD7_TGL;              /**< Segment Data Register 7                            */
        uint32_t             RESERVED41[17U];        /**< Reserved for future use                            */
  __IOM uint32_t             UPDATECTRL_TGL;         /**< Update Control                                     */
        uint32_t             RESERVED42[11U];        /**< Reserved for future use                            */
  __IOM uint32_t             FRAMERATE_TGL;          /**< Frame Rate                                         */
} LCD_TypeDef;
/** @} End of group EFR32SG28_LCD */

/**************************************************************************//**
 * @addtogroup EFR32SG28_LCD
 * @{
 * @defgroup EFR32SG28_LCD_BitFields LCD Bit Fields
 * @{
 *****************************************************************************/

